Revit 2026 API

# CableTrayCurveNormal Property

---

The up-direction vector of the cable tray.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ CurveNormal { get; set; }
```
```vb
Public Property CurveNormal As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ CurveNormal {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member CurveNormal : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

CableTray Class

Autodesk.Revit.DB.Electrical Namespace